[NoCoverage] TrueValue
ImageModel.php:13:9
 
     public function __construct(?PDO $pdo = null) {
         $this->pdo = $pdo;
-        if (!isset($_SESSION['logged_in']) || $_SESSION['logged_in'] !== true) {
+        if (!isset($_SESSION['logged_in']) || $_SESSION['logged_in'] !== false) {
             header('Location: ' . BASE_URL . '/auth/login'); 
             exit();

[NoCoverage] LogicalOrNegation
ImageModel.php:13:9
 
     public function __construct(?PDO $pdo = null) {
         $this->pdo = $pdo;
-        if (!isset($_SESSION['logged_in']) || $_SESSION['logged_in'] !== true) {
+        if (!(!isset($_SESSION['logged_in']) || $_SESSION['logged_in'] !== true)) {
             header('Location: ' . BASE_URL . '/auth/login'); 
             exit();

[NoCoverage] ConcatOperandRemoval
ImageModel.php:14:13
     public function __construct(?PDO $pdo = null) {
         $this->pdo = $pdo;
         if (!isset($_SESSION['logged_in']) || $_SESSION['logged_in'] !== true) {
-            header('Location: ' . BASE_URL . '/auth/login'); 
+            header(BASE_URL . '/auth/login');
             exit();
         }

[NoCoverage] FunctionCallRemoval
ImageModel.php:14:13
     public function __construct(?PDO $pdo = null) {
         $this->pdo = $pdo;
         if (!isset($_SESSION['logged_in']) || $_SESSION['logged_in'] !== true) {
-            header('Location: ' . BASE_URL . '/auth/login'); 
+            
             exit();
         }

[NoCoverage] PublicVisibility
ImageModel.php:19:5
         }
     }
 
-    public function saveImage(int $userId, string $imageName, string $originalFilename, string $imageData, string $mimeType): bool {
+    protected function saveImage(int $userId, string $imageName, string $originalFilename, string $imageData, string $mimeType): bool
         // Sin cambios en esta función
         $sql = "INSERT INTO user_images (user_id, image_name, original_filename, image_data, mime_type) VALUES (:user_id, :image_name, :original_filename, :image_data, :mime_type)";

[NoCoverage] MethodCallRemoval
ImageModel.php:24:13
         $sql = "INSERT INTO user_images (user_id, image_name, original_filename, image_data, mime_type) VALUES (:user_id, :image_name, :original_filename, :image_data, :mime_type)";
         try {
             $stmt = $this->pdo->prepare($sql);
-            $stmt->bindParam(':user_id', $userId, PDO::PARAM_INT);
+            
             $stmt->bindParam(':image_name', $imageName, PDO::PARAM_STR);
             $stmt->bindParam(':original_filename', $originalFilename, PDO::PARAM_STR);

[NoCoverage] MethodCallRemoval
ImageModel.php:25:13
         try {
             $stmt = $this->pdo->prepare($sql);
             $stmt->bindParam(':user_id', $userId, PDO::PARAM_INT);
-            $stmt->bindParam(':image_name', $imageName, PDO::PARAM_STR);
+            
             $stmt->bindParam(':original_filename', $originalFilename, PDO::PARAM_STR);
             $stmt->bindParam(':image_data', $imageData, PDO::PARAM_LOB);

[NoCoverage] MethodCallRemoval
ImageModel.php:26:13
             $stmt = $this->pdo->prepare($sql);
             $stmt->bindParam(':user_id', $userId, PDO::PARAM_INT);
             $stmt->bindParam(':image_name', $imageName, PDO::PARAM_STR);
-            $stmt->bindParam(':original_filename', $originalFilename, PDO::PARAM_STR);
+            
             $stmt->bindParam(':image_data', $imageData, PDO::PARAM_LOB);
             $stmt->bindParam(':mime_type', $mimeType, PDO::PARAM_STR);

[NoCoverage] MethodCallRemoval
ImageModel.php:27:13
             $stmt->bindParam(':user_id', $userId, PDO::PARAM_INT);
             $stmt->bindParam(':image_name', $imageName, PDO::PARAM_STR);
             $stmt->bindParam(':original_filename', $originalFilename, PDO::PARAM_STR);
-            $stmt->bindParam(':image_data', $imageData, PDO::PARAM_LOB);
+            
             $stmt->bindParam(':mime_type', $mimeType, PDO::PARAM_STR);
             return $stmt->execute();

[NoCoverage] MethodCallRemoval
ImageModel.php:28:13
             $stmt->bindParam(':image_name', $imageName, PDO::PARAM_STR);
             $stmt->bindParam(':original_filename', $originalFilename, PDO::PARAM_STR);
             $stmt->bindParam(':image_data', $imageData, PDO::PARAM_LOB);
-            $stmt->bindParam(':mime_type', $mimeType, PDO::PARAM_STR);
+            
             return $stmt->execute();
         } catch (PDOException $e) {

[NoCoverage] Equal
ImageModel.php:31:13
             $stmt->bindParam(':mime_type', $mimeType, PDO::PARAM_STR);
             return $stmt->execute();
         } catch (PDOException $e) {
-            if ($e->getCode() == '23000') {
+            if ($e->getCode() != '23000') {
                 error_log("Error al guardar imagen: Nombre de imagen '$imageName' ya existe para el usuario $userId.");
             } else {

[NoCoverage] FunctionCallRemoval
ImageModel.php:32:17
             return $stmt->execute();
         } catch (PDOException $e) {
             if ($e->getCode() == '23000') {
-                error_log("Error al guardar imagen: Nombre de imagen '$imageName' ya existe para el usuario $userId.");
+                
             } else {
                 error_log("PDOException en saveImage: " . $e->getMessage());

[NoCoverage] ConcatOperandRemoval
ImageModel.php:34:17
             if ($e->getCode() == '23000') {
                 error_log("Error al guardar imagen: Nombre de imagen '$imageName' ya existe para el usuario $userId.");
             } else {
-                error_log("PDOException en saveImage: " . $e->getMessage());
+                error_log("PDOException en saveImage: ");
             }
             return false;

[NoCoverage] Concat
ImageModel.php:34:17
             if ($e->getCode() == '23000') {
                 error_log("Error al guardar imagen: Nombre de imagen '$imageName' ya existe para el usuario $userId.");
             } else {
-                error_log("PDOException en saveImage: " . $e->getMessage());
+                error_log($e->getMessage() . "PDOException en saveImage: ");
             }
             return false;

[NoCoverage] PublicVisibility
ImageModel.php:40:5
         }
     }
 
-    public function getImagesByUserId(int $userId): array {
+    protected function getImagesByUserId(int $userId): array
         // --- CORRECCIÓN ---
         // Se cambia "SELECT id," por "SELECT id_image," para que coincida con la nueva columna.

[NoCoverage] MethodCallRemoval
ImageModel.php:45:9
         // Se cambia "SELECT id," por "SELECT id_image," para que coincida con la nueva columna.
         $sql = "SELECT id_image, image_name, original_filename, uploaded_at FROM user_images WHERE user_id = :user_id ORDER BY uploaded_at DESC";
         $stmt = $this->pdo->prepare($sql);
-        $stmt->execute(['user_id' => $userId]);
+        
         return $stmt->fetchAll(PDO::FETCH_ASSOC);
     }

[NoCoverage] PublicVisibility
ImageModel.php:49:5
         return $stmt->fetchAll(PDO::FETCH_ASSOC);
     }
     
-    public function getImageByNameAndUserId(string $imageName, int $userId): ?array {
+    protected function getImageByNameAndUserId(string $imageName, int $userId): ?array
         // Sin cambios en esta función
         $sql = "SELECT image_data, mime_type FROM user_images WHERE image_name = :image_name AND user_id = :user_id";

[NoCoverage] MethodCallRemoval
ImageModel.php:53:9
         // Sin cambios en esta función
         $sql = "SELECT image_data, mime_type FROM user_images WHERE image_name = :image_name AND user_id = :user_id";
         $stmt = $this->pdo->prepare($sql);
-        $stmt->execute(['image_name' => $imageName, 'user_id' => $userId]);
+        
         $result = $stmt->fetch(PDO::FETCH_ASSOC);
         return $result ?: null;

[NoCoverage] Ternary
ImageModel.php:55:9
         $stmt = $this->pdo->prepare($sql);
         $stmt->execute(['image_name' => $imageName, 'user_id' => $userId]);
         $result = $stmt->fetch(PDO::FETCH_ASSOC);
-        return $result ?: null;
+        return $result ? null : $result;
     }
 

[NoCoverage] PublicVisibility
ImageModel.php:58:5
         return $result ?: null;
     }
 
-    public function deleteImageByIdAndUserId(int $id_image, int $userId): bool {
+    protected function deleteImageByIdAndUserId(int $id_image, int $userId): bool
         // --- CORRECCIÓN ---
         // Se cambia "WHERE id = :id" por "WHERE id_image = :id_image".

[NoCoverage] MethodCallRemoval
ImageModel.php:64:9
         // También se cambia el nombre del parámetro para mayor claridad.
         $sql = "DELETE FROM user_images WHERE id_image = :id_image AND user_id = :user_id";
         $stmt = $this->pdo->prepare($sql);
-        $stmt->bindParam(':id_image', $id_image, PDO::PARAM_INT);
+        
         $stmt->bindParam(':user_id', $userId, PDO::PARAM_INT);
         $stmt->execute();

[NoCoverage] MethodCallRemoval
ImageModel.php:65:9
         $sql = "DELETE FROM user_images WHERE id_image = :id_image AND user_id = :user_id";
         $stmt = $this->pdo->prepare($sql);
         $stmt->bindParam(':id_image', $id_image, PDO::PARAM_INT);
-        $stmt->bindParam(':user_id', $userId, PDO::PARAM_INT);
+        
         $stmt->execute();
         return $stmt->rowCount() > 0;

[NoCoverage] MethodCallRemoval
ImageModel.php:66:9
         $stmt = $this->pdo->prepare($sql);
         $stmt->bindParam(':id_image', $id_image, PDO::PARAM_INT);
         $stmt->bindParam(':user_id', $userId, PDO::PARAM_INT);
-        $stmt->execute();
+        
         return $stmt->rowCount() > 0;
     }

[NoCoverage] GreaterThan
ImageModel.php:67:9
         $stmt->bindParam(':id_image', $id_image, PDO::PARAM_INT);
         $stmt->bindParam(':user_id', $userId, PDO::PARAM_INT);
         $stmt->execute();
-        return $stmt->rowCount() > 0;
+        return $stmt->rowCount() >= 0;
     }
 }

[NoCoverage] GreaterThanNegotiation
ImageModel.php:67:9
         $stmt->bindParam(':id_image', $id_image, PDO::PARAM_INT);
         $stmt->bindParam(':user_id', $userId, PDO::PARAM_INT);
         $stmt->execute();
-        return $stmt->rowCount() > 0;
+        return $stmt->rowCount() <= 0;
     }
 }
