[Killed] PublicVisibility
TemplateModel.php:16:5
     /**
      * Obtiene todas las plantillas activas.
      */
-    public function getActiveTemplates(): array {
+    protected function getActiveTemplates(): array
         $sql = "SELECT id_template, title, description, preview_image_path FROM templates WHERE is_active = 1 ORDER BY title ASC";
         $stmt = $this->pdo->query($sql);
killedBy: TemplateModelTest::testGetActiveTemplatesReturnsArray
statusReason: 1) TemplateModelTest::testGetActiveTemplatesReturnsArray
Error: Call to protected method Dales\Markdown2video\Models\TemplateModel::getActiveTemplates() from scope TemplateModelTest

/home/runner/work/Markdown2VideoDeploy/Markdown2VideoDeploy/tests/TemplateModelTest.php:53

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
TemplateModel.php:25:5
     /**
      * Obtiene el contenido de una plantilla específica por su ID.
      */
-    public function getTemplateContentById(int $id_template): ?string {
+    protected function getTemplateContentById(int $id_template): ?string
         $sql = "SELECT markdown_content FROM templates WHERE id_template = :id_template AND is_active = 1";
         $stmt = $this->pdo->prepare($sql);
killedBy: TemplateModelTest::testGetTemplateContentByIdReturnsContent
statusReason: 1) TemplateModelTest::testGetTemplateContentByIdReturnsContent
Error: Call to protected method Dales\Markdown2video\Models\TemplateModel::getTemplateContentById() from scope TemplateModelTest

/home/runner/work/Markdown2VideoDeploy/Markdown2VideoDeploy/tests/TemplateModelTest.php:96

ERRORS!
Tests: 3, Assertions: 11, Errors: 1.

[Killed] MethodCallRemoval
TemplateModel.php:28:9
     public function getTemplateContentById(int $id_template): ?string {
         $sql = "SELECT markdown_content FROM templates WHERE id_template = :id_template AND is_active = 1";
         $stmt = $this->pdo->prepare($sql);
-        $stmt->execute(['id_template' => $id_template]);
+        
         return $stmt->fetchColumn() ?: null;
     }
killedBy: TemplateModelTest::testGetTemplateContentByIdReturnsContent
statusReason: 1) TemplateModelTest::testGetTemplateContentByIdReturnsContent
Expectation failed for method name is "execute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 3, Assertions: 15, Failures: 1.

[Killed] ArrayItemRemoval
TemplateModel.php:28:9
     public function getTemplateContentById(int $id_template): ?string {
         $sql = "SELECT markdown_content FROM templates WHERE id_template = :id_template AND is_active = 1";
         $stmt = $this->pdo->prepare($sql);
-        $stmt->execute(['id_template' => $id_template]);
+        $stmt->execute([]);
         return $stmt->fetchColumn() ?: null;
     }
killedBy: TemplateModelTest::testGetTemplateContentByIdReturnsContent
statusReason: 1) TemplateModelTest::testGetTemplateContentByIdReturnsContent
Expectation failed for method name is "execute" when invoked 1 time
Parameter 0 for invocation PDOStatement::execute([]): bool does not match expected value.
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (

[Killed] Ternary
TemplateModel.php:29:9
         $sql = "SELECT markdown_content FROM templates WHERE id_template = :id_template AND is_active = 1";
         $stmt = $this->pdo->prepare($sql);
         $stmt->execute(['id_template' => $id_template]);
-        return $stmt->fetchColumn() ?: null;
+        return $stmt->fetchColumn() ? null : $stmt->fetchColumn();
     }
 }
killedBy: TemplateModelTest::testGetTemplateContentByIdReturnsContent
statusReason: 1) TemplateModelTest::testGetTemplateContentByIdReturnsContent
Failed asserting that null matches expected '# Markdown Content\n
\n
This is a template'.

/home/runner/work/Markdown2VideoDeploy/Markdown2VideoDeploy/tests/TemplateModelTest.php:98

FAILURES!
