[Killed] PublicVisibility
UserModel.php:17:5
         $this->pdo = $pdo;
     }
 
-    public function getUserById(int $userId): ?array
+    protected function getUserById(int $userId): ?array
     {
         $query = "SELECT id, username, email, created_at FROM users WHERE id = :id LIMIT 1";
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testGetUserByIdReturnsUserData
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testGetUserByIdReturnsUserData
Error: Call to protected method Dales\Markdown2video\Models\UserModel::getUserById() from scope Dales\Markdown2video\Tests\Models\UserModelTest

/home/runner/work/Markdown2VideoDeploy/Markdown2VideoDeploy/tests/UserModelTest.php:55

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
UserModel.php:23:13
 
         try {
             $stmt = $this->pdo->prepare($query);
-            $stmt->bindParam(':id', $userId, PDO::PARAM_INT);
+            
             $stmt->execute();
             return $stmt->fetch() ?: null;
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testGetUserByIdReturnsUserData
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testGetUserByIdReturnsUserData
Expectation failed for method name is "bindParam" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] MethodCallRemoval
UserModel.php:24:13
         try {
             $stmt = $this->pdo->prepare($query);
             $stmt->bindParam(':id', $userId, PDO::PARAM_INT);
-            $stmt->execute();
+            
             return $stmt->fetch() ?: null;
         } catch (PDOException $e) {
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testGetUserByIdReturnsUserData
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testGetUserByIdReturnsUserData
Expectation failed for method name is "execute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] Ternary
UserModel.php:25:13
             $stmt = $this->pdo->prepare($query);
             $stmt->bindParam(':id', $userId, PDO::PARAM_INT);
             $stmt->execute();
-            return $stmt->fetch() ?: null;
+            return $stmt->fetch() ? null : $stmt->fetch();
         } catch (PDOException $e) {
             if ($this->isTestEnvironment()) {
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testGetUserByIdReturnsUserData
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testGetUserByIdReturnsUserData
null does not match expected type "array".

/home/runner/work/Markdown2VideoDeploy/Markdown2VideoDeploy/tests/UserModelTest.php:57

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Survived] IfNegation
UserModel.php:27:13
             $stmt->execute();
             return $stmt->fetch() ?: null;
         } catch (PDOException $e) {
-            if ($this->isTestEnvironment()) {
-                return null;
-            }
+            if (!$this->isTestEnvironment()) {
             error_log("Error en UserModel::getUserById: " . $e->getMessage());
             return null;

[NoCoverage] Concat
UserModel.php:30:13
             if ($this->isTestEnvironment()) {
                 return null;
             }
-            error_log("Error en UserModel::getUserById: " . $e->getMessage());
+            error_log($e->getMessage() . "Error en UserModel::getUserById: ");
             return null;
         }

[NoCoverage] ConcatOperandRemoval
UserModel.php:30:13
             if ($this->isTestEnvironment()) {
                 return null;
             }
-            error_log("Error en UserModel::getUserById: " . $e->getMessage());
+            error_log($e->getMessage());
             return null;
         }

[Killed] PublicVisibility
UserModel.php:35:5
         }
     }
 
-    public function findByEmail(string $email): ?array
+    protected function findByEmail(string $email): ?array
     {
         $query = "SELECT id, username, email, password_hash FROM users WHERE email = :email LIMIT 1";
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testFindByEmailReturnsUser
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testFindByEmailReturnsUser
Error: Call to protected method Dales\Markdown2video\Models\UserModel::findByEmail() from scope Dales\Markdown2video\Tests\Models\UserModelTest

/home/runner/work/Markdown2VideoDeploy/Markdown2VideoDeploy/tests/UserModelTest.php:129

ERRORS!
Tests: 5, Assertions: 9, Errors: 1.

[Killed] MethodCallRemoval
UserModel.php:41:13
 
         try {
             $stmt = $this->pdo->prepare($query);
-            $stmt->bindParam(':email', $email);
+            
             $stmt->execute();
             return $stmt->fetch() ?: null;
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testFindByEmailReturnsUser
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testFindByEmailReturnsUser
Expectation failed for method name is "bindParam" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 5, Assertions: 11, Failures: 1.

[Killed] MethodCallRemoval
UserModel.php:42:13
         try {
             $stmt = $this->pdo->prepare($query);
             $stmt->bindParam(':email', $email);
-            $stmt->execute();
+            
             return $stmt->fetch() ?: null;
         } catch (PDOException $e) {
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testFindByEmailReturnsUser
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testFindByEmailReturnsUser
Expectation failed for method name is "execute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 5, Assertions: 13, Failures: 1.

[NoCoverage] ConcatOperandRemoval
UserModel.php:48:13
             if ($this->isTestEnvironment()) {
                 return null;
             }
-            error_log("Error en UserModel::findByEmail: " . $e->getMessage());
+            error_log("Error en UserModel::findByEmail: ");
             return null;
         }

[NoCoverage] FunctionCallRemoval
UserModel.php:48:13
             if ($this->isTestEnvironment()) {
                 return null;
             }
-            error_log("Error en UserModel::findByEmail: " . $e->getMessage());
+            
             return null;
         }

[Killed] PublicVisibility
UserModel.php:53:5
         }
     }
 
-    public function findByUsername(string $username): ?array
+    protected function findByUsername(string $username): ?array
     {
         $query = "SELECT id, username FROM users WHERE username = :username LIMIT 1";
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testFindByUsernameReturnsUser
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testFindByUsernameReturnsUser
Error: Call to protected method Dales\Markdown2video\Models\UserModel::findByUsername() from scope Dales\Markdown2video\Tests\Models\UserModelTest

/home/runner/work/Markdown2VideoDeploy/Markdown2VideoDeploy/tests/UserModelTest.php:198

ERRORS!
Tests: 9, Assertions: 17, Errors: 1.

[Killed] MethodCallRemoval
UserModel.php:59:13
 
         try {
             $stmt = $this->pdo->prepare($query);
-            $stmt->bindParam(':username', $username);
+            
             $stmt->execute();
             return $stmt->fetch() ?: null;
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testFindByUsernameReturnsUser
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testFindByUsernameReturnsUser
Expectation failed for method name is "bindParam" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 9, Assertions: 19, Failures: 1.

[Killed] MethodCallRemoval
UserModel.php:60:13
         try {
             $stmt = $this->pdo->prepare($query);
             $stmt->bindParam(':username', $username);
-            $stmt->execute();
+            
             return $stmt->fetch() ?: null;
         } catch (PDOException $e) {
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testFindByUsernameReturnsUser
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testFindByUsernameReturnsUser
Expectation failed for method name is "execute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 9, Assertions: 21, Failures: 1.

[NoCoverage] FunctionCallRemoval
UserModel.php:66:13
             if ($this->isTestEnvironment()) {
                 return null;
             }
-            error_log("Error en UserModel::findByUsername: " . $e->getMessage());
+            
             return null;
         }

[NoCoverage] ConcatOperandRemoval
UserModel.php:66:13
             if ($this->isTestEnvironment()) {
                 return null;
             }
-            error_log("Error en UserModel::findByUsername: " . $e->getMessage());
+            error_log($e->getMessage());
             return null;
         }

[Killed] PublicVisibility
UserModel.php:71:5
         }
     }
 
-    public function createUser(string $username, string $email, string $plainPassword, array $additionalData = []): string|false
+    protected function createUser(string $username, string $email, string $plainPassword, array $additionalData = []): string|false
     {
         $password_hash = password_hash($plainPassword, PASSWORD_DEFAULT);
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testCreateUserSuccess
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testCreateUserSuccess
Error: Call to protected method Dales\Markdown2video\Models\UserModel::createUser() from scope Dales\Markdown2video\Tests\Models\UserModelTest

/home/runner/work/Markdown2VideoDeploy/Markdown2VideoDeploy/tests/UserModelTest.php:278

ERRORS!
Tests: 13, Assertions: 25, Errors: 1.

[Killed] Identical
UserModel.php:74:9
     public function createUser(string $username, string $email, string $plainPassword, array $additionalData = []): string|false
     {
         $password_hash = password_hash($plainPassword, PASSWORD_DEFAULT);
-        if ($password_hash === false) {
+        if ($password_hash !== false) {
             error_log("Error al hashear la contraseña para: $email");
             return false;
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testCreateUserSuccess
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testCreateUserSuccess
Failed asserting that false matches expected '1'.

/home/runner/work/Markdown2VideoDeploy/Markdown2VideoDeploy/tests/UserModelTest.php:279

FAILURES!
Tests: 13, Assertions: 26, Failures: 1.

[Survived] FalseValue
UserModel.php:74:9
     public function createUser(string $username, string $email, string $plainPassword, array $additionalData = []): string|false
     {
         $password_hash = password_hash($plainPassword, PASSWORD_DEFAULT);
-        if ($password_hash === false) {
+        if ($password_hash === true) {
             error_log("Error al hashear la contraseña para: $email");
             return false;

[NoCoverage] FunctionCallRemoval
UserModel.php:75:13
     {
         $password_hash = password_hash($plainPassword, PASSWORD_DEFAULT);
         if ($password_hash === false) {
-            error_log("Error al hashear la contraseña para: $email");
+            
             return false;
         }

[NoCoverage] FalseValue
UserModel.php:76:13
         $password_hash = password_hash($plainPassword, PASSWORD_DEFAULT);
         if ($password_hash === false) {
             error_log("Error al hashear la contraseña para: $email");
-            return false;
+            return true;
         }
 

[Survived] Concat
UserModel.php:87:9
             ':password_hash' => $password_hash
         ];
 
-        $query = "INSERT INTO users (" . implode(', ', $fields) . ") VALUES (" . implode(', ', $placeholders) . ")";
+        $query = "INSERT INTO users (" . ") VALUES (" . implode(', ', $fields) . implode(', ', $placeholders) . ")";
 
         try {

[Survived] ConcatOperandRemoval
UserModel.php:87:9
             ':password_hash' => $password_hash
         ];
 
-        $query = "INSERT INTO users (" . implode(', ', $fields) . ") VALUES (" . implode(', ', $placeholders) . ")";
+        $query = "INSERT INTO users (" . ") VALUES (" . implode(', ', $placeholders) . ")";
 
         try {

[Killed] MethodCallRemoval
UserModel.php:91:13
 
         try {
             $stmt = $this->pdo->prepare($query);
-            $stmt->execute($params);
+            
             return $this->pdo->lastInsertId();
         } catch (PDOException $e) {
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testCreateUserSuccess
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testCreateUserSuccess
Expectation failed for method name is "execute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 13, Assertions: 27, Failures: 1.

[Survived] LogicalNot
UserModel.php:94:13
             $stmt->execute($params);
             return $this->pdo->lastInsertId();
         } catch (PDOException $e) {
-            if (!$this->isTestEnvironment()) {
+            if ($this->isTestEnvironment()) {
                 error_log("Error en UserModel::createUser: " . $e->getMessage());
             }

[NoCoverage] FunctionCallRemoval
UserModel.php:95:17
             return $this->pdo->lastInsertId();
         } catch (PDOException $e) {
             if (!$this->isTestEnvironment()) {
-                error_log("Error en UserModel::createUser: " . $e->getMessage());
+                
             }
             return false;

[NoCoverage] Concat
UserModel.php:95:17
             return $this->pdo->lastInsertId();
         } catch (PDOException $e) {
             if (!$this->isTestEnvironment()) {
-                error_log("Error en UserModel::createUser: " . $e->getMessage());
+                error_log($e->getMessage() . "Error en UserModel::createUser: ");
             }
             return false;

[Killed] PublicVisibility
UserModel.php:101:5
         }
     }
 
-    public function updateUser(int $userId, array $data): bool
+    protected function updateUser(int $userId, array $data): bool
     {
         $allowedFields = ['username', 'email'];
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testUpdateUserReturnsTrueOnSuccess
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testUpdateUserReturnsTrueOnSuccess
Error: Call to protected method Dales\Markdown2video\Models\UserModel::updateUser() from scope Dales\Markdown2video\Tests\Models\UserModelTest

/home/runner/work/Markdown2VideoDeploy/Markdown2VideoDeploy/tests/UserModelTest.php:355

ERRORS!
Tests: 17, Assertions: 31, Errors: 1.

[Killed] ArrayItemRemoval
UserModel.php:103:9
 
     public function updateUser(int $userId, array $data): bool
     {
-        $allowedFields = ['username', 'email'];
+        $allowedFields = ['email'];
         $updateFields = [];
         $params = [':id' => $userId];
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testUpdateUserReturnsTrueOnSuccess
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testUpdateUserReturnsTrueOnSuccess
Failed asserting that false is true.

/home/runner/work/Markdown2VideoDeploy/Markdown2VideoDeploy/tests/UserModelTest.php:356

FAILURES!
Tests: 17, Assertions: 32, Failures: 1.

[Killed] ArrayItemRemoval
UserModel.php:105:9
     {
         $allowedFields = ['username', 'email'];
         $updateFields = [];
-        $params = [':id' => $userId];
+        $params = [];
 
         foreach ($allowedFields as $field) {
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testUpdateUserReturnsTrueOnSuccess
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testUpdateUserReturnsTrueOnSuccess
Expectation failed for method name is "execute" when invoked 1 time
Parameter 0 for invocation PDOStatement::execute([...]): bool does not match expected value.
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (

[Killed] Foreach_
UserModel.php:107:9
         $updateFields = [];
         $params = [':id' => $userId];
 
-        foreach ($allowedFields as $field) {
-            if (array_key_exists($field, $data)) {
-                $updateFields[] = "$field = :$field";
-                $params[":$field"] = $data[$field];
-            }
-        }
+        foreach ([] as $field) {
 
         if (empty($updateFields)) {
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testUpdateUserReturnsTrueOnSuccess
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testUpdateUserReturnsTrueOnSuccess
Failed asserting that false is true.

/home/runner/work/Markdown2VideoDeploy/Markdown2VideoDeploy/tests/UserModelTest.php:356

FAILURES!
Tests: 17, Assertions: 32, Failures: 1.

[Killed] IfNegation
UserModel.php:108:13
         $params = [':id' => $userId];
 
         foreach ($allowedFields as $field) {
-            if (array_key_exists($field, $data)) {
-                $updateFields[] = "$field = :$field";
-                $params[":$field"] = $data[$field];
-            }
+            if (!array_key_exists($field, $data)) {
         }
 
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testUpdateUserReturnsTrueOnSuccess
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testUpdateUserReturnsTrueOnSuccess
Expectation failed for method name is "execute" when invoked 1 time
Parameter 0 for invocation PDOStatement::execute([...]): bool does not match expected value.
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (

[Killed] FalseValue
UserModel.php:115:13
         }
 
         if (empty($updateFields)) {
-            return false;
+            return true;
         }
 
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testUpdateUserReturnsFalseWhenNoFieldsProvided
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testUpdateUserReturnsFalseWhenNoFieldsProvided
Failed asserting that true is false.

/home/runner/work/Markdown2VideoDeploy/Markdown2VideoDeploy/tests/UserModelTest.php:419

FAILURES!
Tests: 21, Assertions: 43, Failures: 1.

[Survived] Concat
UserModel.php:118:9
             return false;
         }
 
-        $query = "UPDATE users SET " . implode(', ', $updateFields) . " WHERE id = :id";
+        $query = implode(', ', $updateFields) . "UPDATE users SET " . " WHERE id = :id";
 
         try {

[Survived] ConcatOperandRemoval
UserModel.php:118:9
             return false;
         }
 
-        $query = "UPDATE users SET " . implode(', ', $updateFields) . " WHERE id = :id";
+        $query = implode(', ', $updateFields) . " WHERE id = :id";
 
         try {

[Killed] GreaterThan
UserModel.php:123:13
         try {
             $stmt = $this->pdo->prepare($query);
             $stmt->execute($params);
-            return $stmt->rowCount() > 0;
+            return $stmt->rowCount() >= 0;
         } catch (PDOException $e) {
             if (!$this->isTestEnvironment()) {
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testUpdateUserReturnsFalseWhenNoRowsAffected
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testUpdateUserReturnsFalseWhenNoRowsAffected
Failed asserting that true is false.

/home/runner/work/Markdown2VideoDeploy/Markdown2VideoDeploy/tests/UserModelTest.php:413

FAILURES!
Tests: 20, Assertions: 41, Failures: 1.

[Killed] GreaterThanNegotiation
UserModel.php:123:13
         try {
             $stmt = $this->pdo->prepare($query);
             $stmt->execute($params);
-            return $stmt->rowCount() > 0;
+            return $stmt->rowCount() <= 0;
         } catch (PDOException $e) {
             if (!$this->isTestEnvironment()) {
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testUpdateUserReturnsTrueOnSuccess
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testUpdateUserReturnsTrueOnSuccess
Failed asserting that false is true.

/home/runner/work/Markdown2VideoDeploy/Markdown2VideoDeploy/tests/UserModelTest.php:356

FAILURES!
Tests: 17, Assertions: 33, Failures: 1.

[NoCoverage] Concat
UserModel.php:126:17
             return $stmt->rowCount() > 0;
         } catch (PDOException $e) {
             if (!$this->isTestEnvironment()) {
-                error_log("Error en UserModel::updateUser: " . $e->getMessage());
+                error_log($e->getMessage() . "Error en UserModel::updateUser: ");
             }
             return false;

[NoCoverage] FunctionCallRemoval
UserModel.php:126:17
             return $stmt->rowCount() > 0;
         } catch (PDOException $e) {
             if (!$this->isTestEnvironment()) {
-                error_log("Error en UserModel::updateUser: " . $e->getMessage());
+                
             }
             return false;

[Killed] PublicVisibility
UserModel.php:132:5
         }
     }
 
-    public function deleteUser(int $userId): bool
+    protected function deleteUser(int $userId): bool
     {
         $query = "DELETE FROM users WHERE id = :id";
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testDeleteUserReturnsTrue
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testDeleteUserReturnsTrue
Error: Call to protected method Dales\Markdown2video\Models\UserModel::deleteUser() from scope Dales\Markdown2video\Tests\Models\UserModelTest

/home/runner/work/Markdown2VideoDeploy/Markdown2VideoDeploy/tests/UserModelTest.php:470

ERRORS!
Tests: 24, Assertions: 45, Errors: 1.

[NoCoverage] ConcatOperandRemoval
UserModel.php:142:17
             return $stmt->rowCount() > 0;
         } catch (PDOException $e) {
             if (!$this->isTestEnvironment()) {
-                error_log("Error en UserModel::deleteUser: " . $e->getMessage());
+                error_log($e->getMessage());
             }
             return false;

[NoCoverage] FunctionCallRemoval
UserModel.php:142:17
             return $stmt->rowCount() > 0;
         } catch (PDOException $e) {
             if (!$this->isTestEnvironment()) {
-                error_log("Error en UserModel::deleteUser: " . $e->getMessage());
+                
             }
             return false;

[Killed] LogicalOrAllSubExprNegation
UserModel.php:150:9
 
     private function isTestEnvironment(): bool
     {
-        return getenv('APP_ENV') === 'testing' || php_sapi_name() === 'cli';
+        return !(getenv('APP_ENV') === 'testing') || !(php_sapi_name() === 'cli');
     }
 }
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testIsTestEnvironment
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testIsTestEnvironment
Failed asserting that false is true.

/home/runner/work/Markdown2VideoDeploy/Markdown2VideoDeploy/tests/UserModelTest.php:533

FAILURES!
Tests: 28, Assertions: 55, Failures: 1.

[Killed] LogicalOr
UserModel.php:150:9
 
     private function isTestEnvironment(): bool
     {
-        return getenv('APP_ENV') === 'testing' || php_sapi_name() === 'cli';
+        return getenv('APP_ENV') === 'testing' && php_sapi_name() === 'cli';
     }
 }
killedBy: Dales\Markdown2video\Tests\Models\UserModelTest::testIsTestEnvironment
statusReason: 1) Dales\Markdown2video\Tests\Models\UserModelTest::testIsTestEnvironment
Failed asserting that false matches expected true.

/home/runner/work/Markdown2VideoDeploy/Markdown2VideoDeploy/tests/UserModelTest.php:537

FAILURES!
Tests: 28, Assertions: 56, Failures: 1.
